DataProcessors/СервисSellmonitor.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СервисSellmonitor</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыМаркетплейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыМаркетплейсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсЯндексМаркет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсOzon</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсWildberries</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсLamoda</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисАналитикиSellmonitor</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Партнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Партнеры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<Comment>Используется для группировки по территориальному признаку</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Используется при анализе первичного интереса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиенты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщики</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Публичное наименование, например, для печати или устного обращения.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конкурент</Name>
					<Comment>Конкуренты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеОтношения</Name>
					<Comment>Прочие отношения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбслуживаетсяТорговымиПредставителями</Name>
					<Comment>Обслуживаются торговыми представителями</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Comment>Перевозчики</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КомпанияЧастноеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПереработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиЭлектронногоЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныйВидЦены</Name>
					<Comment>Уточняющий или индивидуальный вид цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПланированияДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПланированияДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/СервисSellmonitor/Forms/НастройкиИнтеграции/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Обработки.СервисSellmonitor) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр(
			"ru = 'Недостаточно прав для изменение настроек интеграции. Обратитесь к администратору.'"));
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	УчетнаяЗапись = Параметры.УчетнаяЗапись;
	УчетнаяЗаписьМП = Параметры.УчетнаяЗаписьМП;
	ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.СервисАналитикиSellmonitor;

	Элементы.ДекорацияЛоготип.Картинка = ИнтеграцияСМаркетплейсамиКлиентСервер.ЛоготипТорговойПлощадки(ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.СервисАналитикиSellmonitor"));
	
	ИнтеграцияСМаркетплейсамиСИ.ДобавитьЭлементыСостояния(ЭтотОбъект, Элементы.ГруппаУчетнаяЗапись);
	УстановитьКэшированныеЗначения();
	ИнициализироватьЭлементыФормы();
	ИнициироватьДлительныеОперации();
	
	Если Не ПустаяСтрока(Параметры.ТекущаяСтраница) Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[Параметры.ТекущаяСтраница];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Кэш.ПараметрыМенеджераДлительныхОпераций) Тогда
		НачатьВыполнениеДлительныхОперацийПродолжение(Истина, Кэш.ПараметрыМенеджераДлительныхОпераций);
		Кэш.ПараметрыМенеджераДлительныхОпераций = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Маркетплейсы_ЗавершениеМенеджерДлительныхОпераций" Тогда
		
		Если Источник.ИдентификаторНазначения = УникальныйИдентификатор Тогда
			ОбработатьРезультатДлительныхОпераций(Параметр, Источник);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Маркетплейсы_УчетнаяЗаписьУдаление" Тогда
		
		УчетнаяЗаписьПоиск = Элементы.УчетнаяЗапись.СписокВыбора.НайтиПоЗначению(Параметр);
		Если УчетнаяЗаписьПоиск <> Неопределено Тогда
			Элементы.УчетнаяЗапись.СписокВыбора.Удалить(УчетнаяЗаписьПоиск);
		КонецЕсли;
		
		Кэш.УчетныеЗаписи.Удалить(Параметр);
		
		Если УчетнаяЗапись = Параметр Тогда
			УчетнаяЗапись = Неопределено;
			УчетнаяЗаписьПриИзмененииПродолжение();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность И Не ЗавершениеРаботы Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УчетнаяЗаписьПриИзменении(Элемент)
	
	ОчиститьСообщения();
	УчетнаяЗаписьПриИзмененииПродолжение();
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", УчетнаяЗапись);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьМПНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Отбор = Новый Структура("Изменение", Истина);
	НайденныеСтроки = СкладыМаркетплейса.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ТекстВопроса = НСтр("ru = 'Данные по складам изменены. Сохранить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("УчетнаяЗаписьМПНачалоВыбораЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьМППриИзменении(Элемент)
	
	ЗаполнитьФормуПоУчетнойЗаписиМП();
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьМПОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", УчетнаяЗаписьМП);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеПакетаOzonОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, 
			ИнтеграцияСМаркетплейсамиКлиентСервер.ПредставлениеВидаТорговойПлощадки(
				ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon"))) > 0 Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://sellmonitor.com/business/accesses/ozon/");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НаименованиеАккаунтаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://sellmonitor.com/business/accesses/ozon/");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОтметкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Число(Сред(Элемент["Имя"], 25));

	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	
	ПараметрыЗапроса = Новый Структура("Аккаунты", Новый Массив);
	Аккаунт = Новый Структура;
	Аккаунт.Вставить("ИдентификаторАккаунта", Подключения[ТекущаяСтрока].ИдентификаторАккаунта);
	Аккаунт.Вставить("ВидМаркетплейса",  ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon"));
	Если Подключения[ТекущаяСтрока].Отметка Тогда
		Аккаунт.Вставить("УчетнаяЗапись", Подключения[ТекущаяСтрока].УчетнаяЗапись);
	Иначе
		Аккаунт.Вставить("УчетнаяЗапись", ПредопределенноеЗначение("Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка"));
	КонецЕсли;
	
	ПараметрыЗапроса.Аккаунты.Добавить(Аккаунт);
	
	ПараметрыОперации.Очередь.Добавить(ПараметрыЗапроса, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьАккаунтыПодключенныеКSellmonitor());
	НачатьВыполнениеДлительныхОпераций(ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодключенияУчетнаяЗаписьОткрытие(Элемент, СтандартнаяОбработка)
	
	ИндексСтроки = Число(СтрЗаменить(Элемент["Имя"],"СтрокаПодключениеУчетнаяЗапись", ""));
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Подключения[ИндексСтроки].УчетнаяЗапись);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСкладыМаркетплейса

&НаКлиенте
Процедура СкладыМаркетплейсаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СкладыМаркетплейсаНаименованиеСкладаСервисаОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СкладыМаркетплейса.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ИдентификаторСкладаСервиса = "";
	ТекущиеДанные.Изменение = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладыМаркетплейсаНаименованиеСкладаСервисаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Элементы.СкладыМаркетплейсаНаименованиеСкладаСервиса.СписокВыбора;
КонецПроцедуры

&НаКлиенте
Процедура СкладыМаркетплейсаНаименованиеСкладаСервисаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СкладыМаркетплейсаЗаполнитьРеквизитыSellmonitor(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СкладыМаркетплейсаНаименованиеСкладаСервисаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПустаяСтрока(Текст) Тогда
		Для Каждого ЭлементСписка Из Элементы.СкладыМаркетплейсаНаименованиеСкладаСервиса.СписокВыбора Цикл
			Если СтрНачинаетсяС(НРег(ЭлементСписка.Представление), НРег(Текст)) Тогда
				СкладыМаркетплейсаЗаполнитьРеквизитыSellmonitor(ЭлементСписка.Значение);
				Текст = ЭлементСписка.Представление;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	Иначе
		СкладыМаркетплейсаЗаполнитьРеквизитыSellmonitor("");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладыМаркетплейсаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНастройкиИнтеграции();
	Если ЗаписатьНаСервере() Тогда
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьСкладыАвтоматически(Команда)
	СопоставитьСкладыАвтоматическиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокСкладов(Команда)
	Модифицированность = Ложь;
	ЗаполнитьФормуПоУчетнойЗаписиМП();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДлительныеОперации

#Область ИнициализацияДлительныхОпераций

&НаКлиенте
Процедура НачатьВыполнениеДлительныхОпераций(ПараметрыОперации)
	
	ИнтернетПоддержкаПодключена = Ложь;
	ВыполнитьДлительныеОперации(ИнтернетПоддержкаПодключена, ПараметрыОперации);
	
	Если ИнтернетПоддержкаПодключена Тогда
		НачатьВыполнениеДлительныхОперацийПродолжение(Истина, ПараметрыОперации);
	Иначе
		Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеДлительныхОперацийПродолжение", ЭтотОбъект, ПараметрыОперации);
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(Оповещение, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыполнениеДлительныхОперацийПродолжение(Результат, ПараметрыОперации) Экспорт
	
	ФоновоеЗадание = ПараметрыОперации.ФоновоеЗадание;
	
	Если Результат = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Отсутствует подключение к Интернет-поддержке пользователей.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда
		// Повторный вызов метода после подключения к Интернет-поддержке.
		ВыполнитьДлительныеОперации(Ложь, ПараметрыОперации);
		ФоновоеЗадание = ПараметрыОперации.ФоновоеЗадание;
	КонецЕсли;
	
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ФоновоеЗадание.Статус = "Выполняется" Тогда
		ОжидатьЗавершениеДлительныхОпераций(ПараметрыОперации);
	ИначеЕсли ФоновоеЗадание.Статус = "Выполнено" Тогда
		ОбработатьРезультатДлительныхОпераций(ФоновоеЗадание, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершениеДлительныхОпераций(ПараметрыОперации)
	
	Если Не ПараметрыОперации.ВыводитьОкноОжидания Тогда
		
		ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	ИнтеграцияСМаркетплейсамиСИКлиент.ОжидатьЗавершениеДлительныхОпераций(ЭтотОбъект, ПараметрыОперации);
	
КонецПроцедуры

&НаСервере
Процедура ИнициироватьДлительныеОперации()
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ПараметрыОперации.Очередь.Добавить(?(ЗначениеЗаполнено(УчетнаяЗапись), УчетнаяЗапись, Неопределено),
		ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи());
	ПараметрыОперации.ОтменитьМодифицированность = Истина;
	
	// Методы, зависимые от МетодПолучитьУчетныеЗаписи
	ЗависимыеПоля = Новый Соответствие;
	ЗависимыеПоля.Вставить("УчетнаяЗапись", "Ответ.УчетныеЗаписи.0.УчетнаяЗапись");
	ПараметрыМетода = Новый Структура("ЗависитОт, ЗависимыеПоля", 
		ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи(), ЗависимыеПоля);
	ПараметрыОперации.Очередь.Добавить(ПараметрыМетода ,
		ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьАккаунтыПодключенныеКSellmonitor());
		
	Если ЗначениеЗаполнено(УчетнаяЗапись) И ЗначениеЗаполнено(УчетнаяЗаписьМП) Тогда
		ПараметрыОперации.Очередь.Добавить(, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьСкладыМаркетплейса());
	КонецЕсли;
		
	ВыполнитьДлительныеОперации(Ложь, ПараметрыОперации);
	Кэш.ПараметрыМенеджераДлительныхОпераций = ПараметрыОперации;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДлительныеОперации(ИнтернетПоддержкаПодключена, ПараметрыОперации)

	Если Не ИнтеграцияСМаркетплейсамиСИ.ВозможенЗапускФоновогоЗадания(ЭтотОбъект, ПараметрыОперации,
		ИнтернетПоддержкаПодключена) Тогда
		Возврат;
	КонецЕсли;

	Отказ = Ложь;

	ЗаполнитьПараметрыДлительныхОпераций(ПараметрыОперации, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ИнтеграцияСМаркетплейсамиСИ.ВыполнитьДлительныеОперации(ЭтотОбъект, ПараметрыОперации);

КонецПроцедуры

#КонецОбласти

#Область ПараметрыДлительныхОпераций

&НаСервере
Процедура ЗаполнитьПараметрыДлительныхОпераций(ПараметрыОперации, Отказ)
	
	Для Каждого Операция Из ПараметрыОперации.Очередь Цикл
		
		Если Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи() Тогда
			ПараметрыЗапросаПолучитьУчетныеЗаписи(Операция.Значение);
			
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьАккаунтыПодключенныеКSellmonitor() Тогда
			ПараметрыЗапросаПолучитьАккаунтыПодключенныеКSellmonitor(Операция.Значение);
			
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьАккаунтыПодключенныеКSellmonitor() Тогда
			ПараметрыЗапросаВыгрузитьАккаунтыПодключенныеКSellmonitor(Операция.Значение);
			
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьСкладыМаркетплейса() Тогда 
			ПараметрыЗапросаПолучитьСкладыМаркетплейса(Операция.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОперации.ВидМаркетплейса = ВидМаркетплейса;
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаПолучитьУчетныеЗаписи(Значение)
	
	ЗначениеДо = Значение;
	
	Значение = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьУчетныеЗаписи();
	ЗаполнитьЗначенияСвойств(Значение, ЭтотОбъект, , "УчетнаяЗапись");
	Если ТипЗнч(ЗначениеДо) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Значение, ЗначениеДо);
	Иначе
		Значение.УчетнаяЗапись = ЗначениеДо;
	КонецЕсли;
	Значение.ВсеУчетныеЗаписи = Не ЗначениеЗаполнено(Значение.УчетнаяЗапись);
	Значение.ВидМаркетплейса = ВидМаркетплейса;
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаПолучитьАккаунтыПодключенныеКSellmonitor(ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьАккаунтыПодключенныеКSellmonitor();
	ПараметрыЗапроса.УчетнаяЗапись = УчетнаяЗапись;
	
	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;
	
	ПараметрыЗапроса.ВидМаркетплейса = ВидМаркетплейса;
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаВыгрузитьАккаунтыПодключенныеКSellmonitor(ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаВыгрузитьАккаунтыПодключенныеКSellmonitor();

	ПараметрыЗапроса.ВидМаркетплейса = ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = УчетнаяЗапись;
	
	Отбор = Новый Структура("Изменение", Истина, Ложь);

	ОтмеченныеСтроки = Подключения.НайтиСтроки(Отбор);

	Для Каждого Данные Из ОтмеченныеСтроки Цикл

		Аккаунт = ИнтеграцияСМаркетплейсамиСИ.НовыйКарточкаАккаунтаПодключенногоКSellmonitor();

		ИсключаемыеСвойства = ?(Данные.Отметка, "", "УчетнаяЗапись");
		
		ЗаполнитьЗначенияСвойств(Аккаунт, Данные, ,ИсключаемыеСвойства);

		ПараметрыЗапроса.Аккаунты.Добавить(Аккаунт);
	КонецЦикла;

	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаПолучитьСкладыМаркетплейса(ПараметрыЗапроса)
	
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьСкладыМаркетплейса();
	
	ПараметрыЗапроса.ЗапроситьДанныеСМаркетплейса = Истина;

	ПараметрыЗапроса.ВидМаркетплейса = ВидМаркетплейса;
	ПараметрыЗапроса.УчетнаяЗапись = УчетнаяЗапись;
	ПараметрыЗапроса.ВидМаркетплейсаАккаунта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗаписьМП, "ВидМаркетплейса");
	ПараметрыЗапроса.Аккаунт = УчетнаяЗаписьМП;

КонецПроцедуры

#КонецОбласти

#Область РезультатыДлительныхОпераций

&НаКлиенте
Процедура ОбработатьРезультатДлительныхОпераций(Результат, ДополнительныеПараметры)
	
	Отказ = ТипЗнч(Результат) <> Тип("Структура");
	
	Если Отказ Или Результат.Статус <> "Выполнено" Тогда
		ПослеОбработкиРезультатаДлительныхОпераций(Результат, ДополнительныеПараметры, Истина);
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ОбработкаРезультатаНаСервере Тогда
		РезультатМенеджера = ОбработатьРезультатМенеджераДлительныхОпераций(Результат.АдресРезультата, Кэш);
	Иначе
		РезультатМенеджера = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	КонецЕсли;
	
	Очередь = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатМенеджера, "Очередь", Новый СписокЗначений);
	
	Если ДополнительныеПараметры.ОтменитьМодифицированность Тогда
		КодСостояния = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатМенеджера, "КодСостояния", 0);
		Если КодСостояния <> 200 Тогда
			ДополнительныеПараметры.ОтменитьМодифицированность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Операция Из Очередь Цикл
		
		ИмяМетода = Операция.Представление;
		РезультатОперации = Операция.Значение;
		
		Если ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьНастройкиУчетнойЗаписи() Тогда
			Если РезультатОперации Тогда
				Оповестить("Sellmonitor_ОбновлениеНастроек");
			КонецЕсли;
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьАккаунтыПодключенныеКSellmonitor() Тогда
			ЗаполнитьУчетнуюЗаписьМППриПолученииАккаунтов();
		КонецЕсли;
		
	КонецЦикла;
	
	ПослеОбработкиРезультатаДлительныхОпераций(Результат, ДополнительныеПараметры, Отказ);
	
КонецПроцедуры

// Обрабатывает результат менеджера длительных операций на сервере.
// 
// Параметры:
//  АдресРезультата - Строка - Адрес результата
//  Кэш - Структура - Кэш
// 
// Возвращаемое значение:
//  Произвольный - Результат обработки
&НаСервере
Функция ОбработатьРезультатМенеджераДлительныхОпераций(Знач АдресРезультата, Кэш)
	
	РезультатМенеджера = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Очередь = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатМенеджера, "Очередь", Новый СписокЗначений);
	РезультатМенеджера.Вставить("КодСостояния", 200);
	
	Для Каждого Операция Из Очередь Цикл
		
		ИмяМетода = Операция.Представление;
		РезультатОперации = Операция.Значение;
		РезультатОбработки = Истина;
		
		Если ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи() Тогда
			Кэш = ОбработатьРезультатПолучитьУчетныеЗаписи(РезультатОперации, РезультатОбработки);
			ИнтеграцияСМаркетплейсамиСИ.ЗаполнитьЭлементыСостояния(ЭтотОбъект);
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодОбновитьНастройкиУчетнойЗаписи() Тогда
			Кэш = ОбработатьРезультатОбновитьНастройкиУчетнойЗаписи(РезультатОперации, РезультатОбработки);
			Операция.Значение = РезультатОбработки;
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьАккаунтыПодключенныеКSellmonitor() Тогда
			ОбработатьРезультатПолучитьАккаунтыПодключенныеКSellmonitor(РезультатОперации, РезультатОбработки);
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьАккаунтыПодключенныеКSellmonitor() Тогда
			ОбработатьРезультатВыгрузитьАккаунтыПодключенныеКSellmonitor(РезультатОперации, РезультатОбработки);
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьСкладыМаркетплейса() Тогда
			ОбработатьРезультатПолучитьСкладыМаркетплейса(РезультатОперации, РезультатОбработки, Кэш);
		КонецЕсли;
		
		Если РезультатОперации.КодСостояния <> 200 Тогда
			РезультатМенеджера.КодСостояния = РезультатОперации.КодСостояния;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатМенеджера;
	
КонецФункции

&НаКлиенте
Процедура ПослеОбработкиРезультатаДлительныхОпераций(Результат, ДополнительныеПараметры, Отказ)
	
	ОписаниеУчетнойЗаписи = Неопределено;
	
	Если ДополнительныеПараметры.ОтменитьМодифицированность Тогда
		Модифицированность = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьДоступностьПоУчетнойЗаписи(ОписаниеУчетнойЗаписи);
	
	ИнтеграцияСМаркетплейсамиСИКлиент.ПослеОбработкиРезультатаДлительныхОпераций(Результат, ДополнительныеПараметры);
	
	Если ДополнительныеПараметры.ЗакрытьПослеЗавершенияОперации Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

// Обработать результат получить учетные записи.
// 
// Параметры:
//  РезультатОперации - Структура - Результат операции
//  РезультатОбработки - Булево - Результат обработки
// 
// Возвращаемое значение:
//  Соответствие из Структура
&НаСервере
Функция ОбработатьРезультатПолучитьУчетныеЗаписи(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат Кэш;
	КонецЕсли;
	
	Если РезультатОперации.Ответ.ОбновлениеСостояния Тогда
		Если РезультатОперации.КодСостояния = 200 И РезультатОперации.Ответ.УчетныеЗаписи.Количество() = 1 Тогда
			ОписаниеУчетнойЗаписи = РезультатОперации.Ответ.УчетныеЗаписи[0];
			Кэш.УчетныеЗаписи.Вставить(ОписаниеУчетнойЗаписи.УчетнаяЗапись, ОписаниеУчетнойЗаписи);
		Иначе
			Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
				ОбщегоНазначения.СообщитьПользователю(Ошибка);
			КонецЦикла;
		КонецЕсли;
		Возврат Кэш;
	КонецЕсли;
	
	Элементы.УчетнаяЗапись.СписокВыбора.Очистить();
	
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(Ошибка);
		КонецЦикла;
		Возврат Кэш;
	КонецЕсли;
	
	Кэш.УчетныеЗаписи.Очистить();
	
	Для Каждого ОписаниеУчетнойЗаписи Из РезультатОперации.Ответ.УчетныеЗаписи Цикл
		Элементы.УчетнаяЗапись.СписокВыбора.Добавить(ОписаниеУчетнойЗаписи.УчетнаяЗапись,
			ОписаниеУчетнойЗаписи.Представление);
		Кэш.УчетныеЗаписи.Вставить(ОписаниеУчетнойЗаписи.УчетнаяЗапись, ОписаниеУчетнойЗаписи);
	КонецЦикла;
	
	Если Кэш.УчетныеЗаписи.Количество() = 1 Тогда
		УчетнаяЗапись = ОписаниеУчетнойЗаписи.УчетнаяЗапись;
	КонецЕсли;
	
	Возврат Кэш;
	
КонецФункции

// Обработать результат обновить настройки учетной записи.
// 
// Параметры:
//  РезультатОперации - Структура - Результат операции
//  РезультатОбработки - Булево - Результат обработки
// 
// Возвращаемое значение:
//  Структура - Кэш
&НаСервере
Функция ОбработатьРезультатОбновитьНастройкиУчетнойЗаписи(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат Кэш;
	КонецЕсли;
	
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(Ошибка);
		КонецЦикла;
		РезультатОбработки = Ложь;
	КонецЕсли;
	
	ОписаниеУчетнойЗаписи = Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись);
	ЗаполнитьЗначенияСвойств(ОписаниеУчетнойЗаписи, ЭтотОбъект);
	
	Если РезультатОперации.КодСостояния <> 200 Тогда
		Возврат Кэш;
	КонецЕсли;
	
	// При необходимости создадим узлы плана обмена и зарегистрируем склады к выгрузке
	ДанныеФормы = Новый Структура;
	ДанныеФормы.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	
	ПриЗаписиНаСервере(ОписаниеУчетнойЗаписи, ДанныеФормы, УзелОбмена);
	
	Возврат Кэш;
	
КонецФункции

&НаСервере
Процедура ОчиститьЭлементыПодключения()
	
	ОписаниеПакетаOzon = Неопределено;
	Элементы.ПодсказкаПодключения.Видимость = Ложь;
	Элементы.ГруппаОписаниеПакета.Видимость = Ложь;
	
	ТекущаяСтрока = Элементы.ГруппаПодключениеОтметка.ПодчиненныеЭлементы.Количество()-1;
	Пока ТекущаяСтрока >= 0 Цикл
		Элементы.Удалить(Элементы.ГруппаПодключениеОтметка.ПодчиненныеЭлементы[ТекущаяСтрока]);
		Элементы.Удалить(Элементы.ГруппаПодключениеВидМаркетплейсаПредставление.ПодчиненныеЭлементы[ТекущаяСтрока]);
		Элементы.Удалить(Элементы.ГруппаПодключениеУчетнаяЗапись.ПодчиненныеЭлементы[ТекущаяСтрока]);
		Элементы.Удалить(Элементы.ГруппаПодключениеНаименованиеАккаунта.ПодчиненныеЭлементы[ТекущаяСтрока]);
		
		ТекущаяСтрока = ТекущаяСтрока -1;
	КонецЦикла;
	
	Подключения.Очистить();
	Элементы.УчетнаяЗаписьМП.СписокВыбора.Очистить();
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗаписьМП = Справочники.УчетныеЗаписиМаркетплейсов.ПустаяСсылка();
	КонецЕсли;
	СкладыМаркетплейса.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭлементыПодключения(ТорговыеПлощадки, Аккаунты)
	
	ДоступныеВидыМП = ИнтеграцияСSellmonitorКлиентСервер.ДоступныеВидыМаркетплейсов();
	
	ЕстьДанные = Ложь;
	
	ШаблонДоступноМагазинов = НСтр("ru='- Доступно магазинов: %1 из %2 <a href=""%3"">(Докупить)</a>'");
	
	Если ТорговыеПлощадки.Количество() > 0 Тогда
		
		Для Каждого ОписанииеТП Из ТорговыеПлощадки Цикл
			
			СсылкаДокупитьПодключения = СтрШаблон("ByAccount%1", ОписанииеТП.Ключ);
			
			Если ОписанииеТП.Ключ = "Ozon" Тогда
				
				Элементы.ГруппаОписаниеПакетаOzon.Видимость = Истина;
				ЕстьДанные = Истина;
				
				ПодключеноМагазинов = (ОписанииеТП.Значение - Аккаунты.Количество());
				ДоступноМагазинов = ОписанииеТП.Значение;
				
				ОписаниеПакетаOzon = СтроковыеФункции.ФорматированнаяСтрока(ШаблонДоступноМагазинов,
					ПодключеноМагазинов, ДоступноМагазинов, СсылкаДокупитьПодключения);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Элементы.ГруппаОписаниеПакета.Видимость = ЕстьДанные;
	
	// Заполнение соответствий учетных записей
	НомерСтроки = 0;
	
	Для Каждого ОписаниеАккаунта Из Аккаунты Цикл
		
		Если ДоступныеВидыМП.Найти(ОписаниеАккаунта.ВидМаркетплейса) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеАккаунта.УчетнаяЗапись) Тогда
			Элементы.УчетнаяЗаписьМП.СписокВыбора.Добавить(ОписаниеАккаунта.УчетнаяЗапись);
		КонецЕсли;
		
		НоваяСтрока = Подключения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеАккаунта);
		НоваяСтрока.ИдентификаторСтроки = НомерСтроки;
		НоваяСтрока.Отметка = ЗначениеЗаполнено(ОписаниеАккаунта.УчетнаяЗапись);
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Подключения.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Подключения.ИдентификаторАккаунтаМП КАК ИдентификаторАккаунтаМП,
	|	Подключения.УчетнаяЗапись КАК УчетнаяЗапись,
	|	Подключения.ВидМаркетплейса КАК ВидМаркетплейса
	|ПОМЕСТИТЬ врПодключения
	|ИЗ
	|	&Подключения КАК Подключения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетныеЗаписиМП.Ссылка КАК УчетнаяЗапись,
	|	УчетныеЗаписиМП.ИдентификаторКлиента КАК ИдентификаторКлиента,
	|	УчетныеЗаписиМП.ВидМаркетплейса КАК ВидМаркетплейса
	|ПОМЕСТИТЬ врДоступныеУчетныеЗаписи
	|ИЗ
	|	Справочник.УчетныеЗаписиМаркетплейсов КАК УчетныеЗаписиМП
	|ГДЕ
	|	УчетныеЗаписиМП.ВидМаркетплейса В(&ДоступныеВидыМП)
	|	И НЕ УчетныеЗаписиМП.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(врПодключения.ИдентификаторСтроки, 99999) КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(врПодключения.ВидМаркетплейса, ДоступныеУчетныеЗаписи.ВидМаркетплейса) КАК ВидМаркетплейса,
	|	ВЫБОР
	|		КОГДА врПодключения.УчетнаяЗапись <> ЗНАЧЕНИЕ(Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка)
	|			ТОГДА врПодключения.УчетнаяЗапись
	|		КОГДА ДоступныеУчетныеЗаписи.УчетнаяЗапись ЕСТЬ НЕ NULL 
	|			ТОГДА ДоступныеУчетныеЗаписи.УчетнаяЗапись
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка)
	|	КОНЕЦ КАК УчетнаяЗапись,
	|	ВЫБОР
	|		КОГДА врПодключения.УчетнаяЗапись <> ЗНАЧЕНИЕ(Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка)
	|				И ДоступныеУчетныеЗаписи.УчетнаяЗапись ЕСТЬ НЕ NULL 
	|			ТОГДА &Сопоставлена
	|		КОГДА врПодключения.УчетнаяЗапись <> ЗНАЧЕНИЕ(Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка)
	|				И ДоступныеУчетныеЗаписи.УчетнаяЗапись ЕСТЬ NULL
	|			ТОГДА &СопоставленаНекорректно
	|		КОГДА врПодключения.УчетнаяЗапись = ЗНАЧЕНИЕ(Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка)
	|				И ДоступныеУчетныеЗаписи.УчетнаяЗапись ЕСТЬ НЕ NULL 
	|			ТОГДА &НеСопоставлена
	|		ИНАЧЕ &НеЗарегистрирована
	|	КОНЕЦ КАК Состояние
	|ИЗ
	|	врПодключения КАК врПодключения
	|		ПОЛНОЕ СОЕДИНЕНИЕ врДоступныеУчетныеЗаписи КАК ДоступныеУчетныеЗаписи
	|		ПО врПодключения.ИдентификаторАккаунтаМП = ДоступныеУчетныеЗаписи.ИдентификаторКлиента
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторСтроки";
	
	Запрос.УстановитьПараметр("Подключения", Подключения.Выгрузить(,"ИдентификаторСтроки, ИдентификаторАккаунтаМП, УчетнаяЗапись, ВидМаркетплейса"));
	Запрос.УстановитьПараметр("Сопоставлена", 1);
	Запрос.УстановитьПараметр("СопоставленаНекорректно", 2);
	Запрос.УстановитьПараметр("НеСопоставлена", 3);
	Запрос.УстановитьПараметр("НеЗарегистрирована", 4);
	
	Запрос.УстановитьПараметр("ДоступныеВидыМП", ДоступныеВидыМП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Дозаполнение строк
		Если Выборка.ИдентификаторСтроки = 99999 Тогда
			ТекущаяСтрока = Подключения.Добавить();
			ТекущаяСтрока.ИдентификаторСтроки = Подключения.Количество() - 1;
		Иначе
			ТекущаяСтрока = Подключения[Выборка.ИдентификаторСтроки];
		КонецЕсли;
		ТекущаяСтрока.УчетнаяЗапись = Выборка.УчетнаяЗапись;
		ТекущаяСтрока.ВидМаркетплейса = Выборка.ВидМаркетплейса;
		
		Если Выборка.Состояние = Запрос.Параметры.НеЗарегистрирована Тогда
			ТекущаяСтрока.НаименованиеАккаунта = "Зарегистрировать";
		КонецЕсли;
		
		// Отрисовка элементов формы
		ЭлементФормы = Элементы.Добавить("СтрокаПодключениеОтметка" + ТекущаяСтрока.ИдентификаторСтроки,
			Тип("ПолеФормы"), Элементы.ГруппаПодключениеОтметка);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
		ЭлементФормы.ВидФлажка = ВидФлажка.Выключатель;
		ЭлементФормы.ПутьКДанным = "Подключения[" + ТекущаяСтрока.ИдентификаторСтроки +"].Отметка";
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормы.Доступность = Выборка.Состояние = Запрос.Параметры.Сопоставлена Или Выборка.Состояние = Запрос.Параметры.НеСопоставлена;
		ЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ОтметкаПриИзменении");
		
		ЭлементФормы = Элементы.Добавить("СтрокаПодключениеНаименованиеАккаунта" + ТекущаяСтрока.ИдентификаторСтроки,
			Тип("ПолеФормы"), Элементы.ГруппаПодключениеНаименованиеАккаунта);
		ЭлементФормы.ПутьКДанным = "Подключения[" + ТекущаяСтрока.ИдентификаторСтроки +"].НаименованиеАккаунта";
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Если Выборка.Состояние = Запрос.Параметры.НеЗарегистрирована Тогда
			ЭлементФормы.Вид = ВидПоляФормы.ПолеНадписи;
			ЭлементФормы.Гиперссылка = Истина;
			ЭлементФормы.УстановитьДействие("Нажатие", "Подключаемый_НаименованиеАккаунтаНажатие");
		Иначе
			ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
			ЭлементФормы.КнопкаВыпадающегоСписка = Ложь;
			ЭлементФормы.КнопкаОткрытия = Ложь;
			ЭлементФормы.РедактированиеТекста = Ложь;
			ЭлементФормы.Доступность = Ложь;
			ЭлементФормы.ПропускатьПриВводе = Истина;
		КонецЕсли;
		
		ЭлементФормы = Элементы.Добавить("СтрокаПодключениеВидМаркетплейсаПредставление" + ТекущаяСтрока.ИдентификаторСтроки,
			Тип("ПолеФормы"), Элементы.ГруппаПодключениеВидМаркетплейсаПредставление);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеКартинки;
		Если ТекущаяСтрока.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
			ЭлементФормы.КартинкаЗначений = БиблиотекаКартинок.ЛоготипOzon2;
		ИначеЕсли ТекущаяСтрока.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсWildberries Тогда
			ЭлементФормы.КартинкаЗначений = БиблиотекаКартинок.ЛоготипWildberries;
		КонецЕсли;
		ЭлементФормы.РазмерКартинки = РазмерКартинки.АвтоРазмерБезУчетаМасштаба;
		ЭлементФормы.ПутьКДанным = "Подключения[" + ТекущаяСтрока.ИдентификаторСтроки +"].ВидМаркетплейсаПредставление";
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормы.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
		ЭлементФормы.ПропускатьПриВводе = Истина;
		
		ЭлементФормы = Элементы.Добавить("СтрокаПодключениеУчетнаяЗапись" + ТекущаяСтрока.ИдентификаторСтроки,
			Тип("ПолеФормы"), Элементы.ГруппаПодключениеУчетнаяЗапись);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "Подключения[" + ТекущаяСтрока.ИдентификаторСтроки +"].УчетнаяЗапись";
		ЭлементФормы.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормы.КнопкаВыпадающегоСписка = Ложь;
		ЭлементФормы.КнопкаОткрытия = Ложь;
		ЭлементФормы.РедактированиеТекста = Ложь;
		ЭлементФормы.ТолькоПросмотр = Истина;
		ЭлементФормы.УстановитьДействие("Открытие", "Подключаемый_ПодключенияУчетнаяЗаписьОткрытие");
		
	КонецЦикла;
	
	Если Выборка.Количество() > 0 Тогда
		Элементы.ПодсказкаПодключения.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатПолучитьАккаунтыПодключенныеКSellmonitor(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	ОчиститьЭлементыПодключения();
	
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(Ошибка);
		КонецЦикла;
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Результат = РезультатОперации.Ответ;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЭлементыПодключения(Результат.ТорговыеПлощадки, Результат.Аккаунты);
	
	Кэш.Склады.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыгрузитьАккаунтыПодключенныеКSellmonitor(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(Ошибка);
		КонецЦикла;
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.УчетнаяЗаписьМП.СписокВыбора.Очистить();
	
	Для Каждого СтрокаПодключения Из Подключения Цикл
		Если СтрокаПодключения.Отметка Тогда
			Элементы.УчетнаяЗаписьМП.СписокВыбора.Добавить(СтрокаПодключения.УчетнаяЗапись);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(УчетнаяЗаписьМП)
		И Элементы.УчетнаяЗаписьМП.СписокВыбора.НайтиПоЗначению(УчетнаяЗаписьМП) = Неопределено Тогда
		УчетнаяЗаписьМП = Справочники.УчетныеЗаписиМаркетплейсов.ПустаяСсылка();
		СкладыМаркетплейса.Очистить();
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатПолучитьСкладыМаркетплейса(РезультатОперации, РезультатОбработки, Кэш)
	
	Кэш.Склады = Новый Соответствие;
	
	СписокВыбораСклада = Элементы.СкладыМаркетплейсаНаименованиеСкладаСервиса.СписокВыбора;
	СписокВыбораСклада.Очистить();
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(Ошибка);
		КонецЦикла;
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Для Каждого Склад Из РезультатОперации.СкладыМаркетплейса Цикл
		Кэш.Склады.Вставить(Склад.ИдентификаторСкладаСервиса, Склад);
		СписокВыбораСклада.Добавить(Склад.ИдентификаторСкладаСервиса, Склад.НаименованиеСкладаСервиса);
	КонецЦикла;
	
	СписокВыбораСклада.СортироватьПоПредставлению();
	
	ЗаполнитьСкладыМаркетплейса();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

&НаСервере
Процедура УстановитьКэшированныеЗначения()
	
	Кэш = Новый Структура;
	Кэш.Вставить("ПараметрыМенеджераДлительныхОпераций");
	Кэш.Вставить("УчетныеЗаписи", Новый Соответствие);
	Кэш.Вставить("Склады", Новый Соответствие);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьЭлементыФормы()
	Заголовок = СтрШаблон(НСтр("ru = 'Настройки интеграции с %1'"), 
		ИнтеграцияСМаркетплейсамиПовтИсп.ПредставлениеВидаТорговойПлощадки(Перечисления.ВидыМаркетплейсов.СервисАналитикиSellmonitor));
		
	Элементы.ПодсказкаПодключения.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьПоУчетнойЗаписи(ОписаниеУчетнойЗаписи = Неопределено)
	
	ДоступностьПоУчетнойЗаписи = ЗначениеЗаполнено(УчетнаяЗапись);
	
	Элементы.Записать.Доступность = ДоступностьПоУчетнойЗаписи;
	
	Если ОписаниеУчетнойЗаписи = Неопределено И ДоступностьПоУчетнойЗаписи Тогда
		ОписаниеУчетнойЗаписи = Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПриЗаписиНаСервере(Знач ОписаниеУчетнойЗаписи, Знач ДанныеФормы, УзелОбмена)
	
	Если Не ЗначениеЗаполнено(ОписаниеУчетнойЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = Блокировка.Добавить("Справочник.УчетныеЗаписиМаркетплейсов");
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ДанныеФормы.УчетнаяЗапись);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
	
		УчетнаяЗаписьОбъект = ДанныеФормы.УчетнаяЗапись.ПолучитьОбъект();
		УчетнаяЗаписьОбъект.ВалютаУчета = Справочники.Валюты.ПустаяСсылка();
		УчетнаяЗаписьОбъект.Партнер = Справочники.Партнеры.ПустаяСсылка();
		УчетнаяЗаписьОбъект.ВидыЦен.Очистить();
		
		УчетнаяЗаписьОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИнтеграцияСМаркетплейсамиСервер.СобытиеЖурналаРегистрации(ДанныеФормы.УчетнаяЗапись),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			НСтр("ru = 'Ошибка при восстановлении ""%1"". Возможно, объект уже редактируется.'"),
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеФормы.УчетнаяЗапись, "Наименование")));
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаписатьНастройкиИнтеграции(Истина);
		Если ЗаписатьНаСервере() Тогда
			Модифицированность = Ложь;
		КонецЕсли;
		Закрыть();
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройкиИнтеграции(ЗакрытьПослеЗавершенияОперации = Ложь)
	
	ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
	ПараметрыОперации.ОтменитьМодифицированность = Истина;
	ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	ПараметрыОперации.ЗакрытьПослеЗавершенияОперации = ЗакрытьПослеЗавершенияОперации;
	
	Отбор = Новый Структура("Изменение", Истина);
	НайденныеСтроки = Подключения.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодВыгрузитьАккаунтыПодключенныеКSellmonitor());
		НачатьВыполнениеДлительныхОпераций(ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьПриИзмененииПродолжение()
	
	ОписаниеУчетнойЗаписи = Неопределено;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		
		ОчиститьЭлементыПодключения();
		
	Иначе
		
		ОписаниеУчетнойЗаписи = Кэш.УчетныеЗаписи.Получить(УчетнаяЗапись);
		
		// См. ИнтеграцияСМаркетплейсамиСИ.ВыполнитьДлительнуюОперацию
		ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
		ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
		ПараметрыМетода = Новый Структура("УчетнаяЗапись, ОбновлениеСостояния", УчетнаяЗапись, Истина);
		ПараметрыОперации.Очередь.Добавить(ПараметрыМетода, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи());
		
		// Методы, зависимые от МетодПолучитьУчетныеЗаписи
		ПараметрыМетода = Новый Структура("ЗависитОт, УчетнаяЗапись",	// зависимые поля здесь не используются 
			ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи(), УчетнаяЗапись);
		ПараметрыОперации.Очередь.Добавить(ПараметрыМетода ,
			ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьАккаунтыПодключенныеКSellmonitor());
		
		НачатьВыполнениеДлительныхОпераций(ПараметрыОперации);
		
	КонецЕсли;
	
	УстановитьВидимостьДоступностьПоУчетнойЗаписи(ОписаниеУчетнойЗаписи);
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСкладыМаркетплейса()
	
	СкладыМаркетплейса.Очистить();
	
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьМП) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СкладыМП.НаименованиеОбъектаМаркетплейса КАК НаименованиеСкладаМП,
	|	СкладыМП.ИдентификаторОбъектаМаркетплейса КАК ИдентификаторСкладаМП,
	|	ЕСТЬNULL(СкладыSellmonitor.ИдентификаторОбъектаМаркетплейса, """") КАК ИдентификаторСкладаСервиса,
	|	ЕСТЬNULL(СкладыSellmonitor.НаименованиеОбъектаМаркетплейса, """") КАК НаименованиеСкладаСервиса,
	|	ВЫБОР
	|		КОГДА СкладыМП.ИспользуетсяДляСхемыРаботыFBO
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СхемыРаботыТорговыхПлощадок.FBO)
	|		КОГДА СкладыМП.ИспользуетсяДляСхемыРаботыFBS
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СхемыРаботыТорговыхПлощадок.FBS)
	|		КОГДА СкладыМП.ИспользуетсяДляСхемыРаботыDBS
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СхемыРаботыТорговыхПлощадок.DBS)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СхемыРаботыТорговыхПлощадок.ПустаяСсылка)
	|	КОНЕЦ КАК СхемаРаботыСклада
	|ИЗ
	|	РегистрСведений.СоответствияОбъектовМаркетплейсов КАК СкладыМП
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовМаркетплейсов КАК СкладыSellmonitor
	|		ПО СкладыМП.ИдентификаторОбъектаМаркетплейса = СкладыSellmonitor.Объект1С
	|		И СкладыSellmonitor.УчетнаяЗаписьМаркетплейса = &УчетнаяЗаписьSellmonitor
	|		И СкладыSellmonitor.ВидОбъектаМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовМаркетплейсов.Склад)
	|		И СкладыSellmonitor.ИдентификаторВладельцаОбъектаМаркетплейса = &ИдентификаторВладельцаОбъектаМаркетплейса
	|ГДЕ
	|	СкладыМП.УчетнаяЗаписьМаркетплейса = &УчетнаяЗаписьМП
	|	И СкладыМП.ВидОбъектаМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовМаркетплейсов.Склад)
	|	И СкладыМП.ИдентификаторОбъектаМаркетплейса <> """"
	|	И (СкладыМП.ИспользуетсяДляСхемыРаботыFBO
	|	ИЛИ СкладыМП.ИспользуетсяДляСхемыРаботыFBS
	|	ИЛИ СкладыМП.ИспользуетсяДляСхемыРаботыDBS)";
	
	Запрос.УстановитьПараметр("УчетнаяЗаписьМП", УчетнаяЗаписьМП);
	Запрос.УстановитьПараметр("УчетнаяЗаписьSellmonitor", УчетнаяЗапись);
	Запрос.УстановитьПараметр("ИдентификаторВладельцаОбъектаМаркетплейса", XMLСтрока(УчетнаяЗаписьМП));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СкладыМаркетплейса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьМПНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		Если ЗаписатьСклады() Тогда
			Модифицированность = Ложь;
		КонецЕсли;
	Иначе
		Модифицированность = Ложь;
	КонецЕсли;
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("УчетнаяЗаписьМПНачалоВыбораЗавершениеЗавершение", ЭтотОбъект), Элементы.УчетнаяЗаписьМП.СписокВыбора, УчетнаяЗаписьМП);

КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьМПНачалоВыбораЗавершениеЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры1) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяЗаписьМП =  ВыбранныйЭлемент.Значение;
	ЗаполнитьФормуПоУчетнойЗаписиМП();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФормуПоУчетнойЗаписиМП()
	
	Если ЗначениеЗаполнено(УчетнаяЗаписьМП) Тогда
		ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
		ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
		ПараметрыОперации.РежимОткрытияОкнаОжидания = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ПараметрыОперации.Очередь.Добавить(, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьСкладыМаркетплейса());
		
		НачатьВыполнениеДлительныхОпераций(ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()
	Возврат ЗаписатьСклады();
КонецФункции

&НаСервере
Функция ЗаписатьСклады()
	
	Результат = Истина;
	
	Отбор = Новый Структура("Изменение", Истина);
	
	НайденныеСтроки = СкладыМаркетплейса.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			ИдУчетнаяЗаписьМП = XMLСтрока(УчетнаяЗаписьМП);
			
			НаборЗаписей = РегистрыСведений.СоответствияОбъектовМаркетплейсов.СоздатьНаборЗаписей();
			
			НаборЗаписей = РегистрыСведений.СоответствияОбъектовМаркетплейсов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.УчетнаяЗаписьМаркетплейса.Установить(УчетнаяЗапись);
			НаборЗаписей.Отбор.ВидОбъектаМаркетплейса.Установить(Перечисления.ВидыОбъектовМаркетплейсов.Склад);
			НаборЗаписей.Отбор.ИдентификаторВладельцаОбъектаМаркетплейса.Установить(ИдУчетнаяЗаписьМП);
			НаборЗаписей.Отбор.Объект1С.Установить(НайденнаяСтрока.ИдентификаторСкладаМП);
			
			Если Не ПустаяСтрока(НайденнаяСтрока.ИдентификаторСкладаСервиса) Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.УчетнаяЗаписьМаркетплейса = УчетнаяЗапись;
				Запись.ВидОбъектаМаркетплейса = Перечисления.ВидыОбъектовМаркетплейсов.Склад;
				Запись.ИдентификаторОбъектаМаркетплейса = НайденнаяСтрока.ИдентификаторСкладаСервиса;
				
				Запись.ИдентификаторВладельцаОбъектаМаркетплейса = ИдУчетнаяЗаписьМП;
				Запись.Объект1С = НайденнаяСтрока.ИдентификаторСкладаМП;
				
				Запись.НаименованиеОбъектаМаркетплейса = НайденнаяСтрока.НаименованиеСкладаСервиса;
				
				Если НайденнаяСтрока.СхемаРаботыСклада = Перечисления.СхемыРаботыТорговыхПлощадок.FBO Тогда
					Запись.ИспользуетсяДляСхемыРаботыFBO = Истина;
				ИначеЕсли НайденнаяСтрока.СхемаРаботыСклада = Перечисления.СхемыРаботыТорговыхПлощадок.FBS Тогда
					Запись.ИспользуетсяДляСхемыРаботыFBS = Истина;
				ИначеЕсли НайденнаяСтрока.СхемаРаботыСклада = Перечисления.СхемыРаботыТорговыхПлощадок.DBS Тогда
					Запись.ИспользуетсяДляСхемыРаботыDBS = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Попытка
				НаборЗаписей.Записать(Истина);
				НайденнаяСтрока.Изменение = Ложь;
			Исключение
				Результат = Ложь;
				ЗаписьЖурналаРегистрации(ИнтеграцияСSellmonitorСервер.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,,,
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СкладыМаркетплейсаЗаполнитьРеквизитыSellmonitor(ВыбранноеЗначение)
	
	ТекущиеДанные = Элементы.СкладыМаркетплейса.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ИдентификаторСкладаСервиса = ВыбранноеЗначение;
	Если Не ПустаяСтрока(ВыбранноеЗначение) Тогда
		ТекущиеДанные.НаименованиеСкладаСервиса = Кэш.Склады[ВыбранноеЗначение].НаименованиеСкладаСервиса;
	Иначе
		ТекущиеДанные.НаименованиеСкладаСервиса = "";
	КонецЕсли;
	ТекущиеДанные.Изменение = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьСкладыАвтоматическиНаСервере()
	
	СоответствияСкладов = Новый Соответствие;
	
	Для Каждого СкладSellmonitor Из Кэш.Склады Цикл
		ДанныеСоответствия = СоответствияСкладов.Получить(СкладSellmonitor.Значение.ИдентификаторСкладаМаркетплейса);	// Массив Из Строка
		Если ДанныеСоответствия = Неопределено Тогда
			ДанныеСоответствия = Новый Массив;
			ДанныеСоответствия.Добавить(СкладSellmonitor.Значение);
			СоответствияСкладов.Вставить(СкладSellmonitor.Значение.ИдентификаторСкладаМаркетплейса, ДанныеСоответствия);
		Иначе
			ДанныеСоответствия.Добавить(СкладSellmonitor.Значение);
			СоответствияСкладов.Вставить(СкладSellmonitor.Значение.ИдентификаторСкладаМаркетплейса, ДанныеСоответствия);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаСкладыМаркетплейса Из СкладыМаркетплейса Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаСкладыМаркетплейса.ИдентификаторСкладаСервиса) Тогда
			СкладыSellmonitor = СоответствияСкладов.Получить(СтрокаСкладыМаркетплейса.ИдентификаторСкладаМП);
			Если СкладыSellmonitor <> Неопределено Тогда
				
				Если СкладыSellmonitor.Количество() = 1 Тогда
					СтрокаСкладыМаркетплейса.ИдентификаторСкладаСервиса = СкладыSellmonitor[0].ИдентификаторСкладаСервиса;
					СтрокаСкладыМаркетплейса.НаименованиеСкладаСервиса = СкладыSellmonitor[0].НаименованиеСкладаСервиса;
				Иначе
					Для Каждого СкладSellmonitor Из СкладыSellmonitor Цикл
						// Поиск по наименованию
						Если СкладSellmonitor.НаименованиеСкладаСервиса = СтрокаСкладыМаркетплейса.НаименованиеСкладаМП Тогда
							СтрокаСкладыМаркетплейса.ИдентификаторСкладаСервиса = СкладSellmonitor.ИдентификаторСкладаСервиса;
							СтрокаСкладыМаркетплейса.НаименованиеСкладаСервиса = СкладSellmonitor.НаименованиеСкладаСервиса;
						КонецЕсли;
					КонецЦикла;
					
					Если Не ЗначениеЗаполнено(СтрокаСкладыМаркетплейса.ИдентификаторСкладаСервиса) Тогда
						// Не нашли по наименованию - берем первый попавшийся
						СтрокаСкладыМаркетплейса.ИдентификаторСкладаСервиса = СкладыSellmonitor[0].ИдентификаторСкладаСервиса;
						СтрокаСкладыМаркетплейса.НаименованиеСкладаСервиса = СкладыSellmonitor[0].НаименованиеСкладаСервиса;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаСкладыМаркетплейса.Изменение = Истина;
			
			Модифицированность = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчетнуюЗаписьМППриПолученииАккаунтов()
	
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьМП) И
		Элементы.УчетнаяЗаписьМП.СписокВыбора.Количество() = 1 Тогда
		
		УчетнаяЗаписьМП = Элементы.УчетнаяЗаписьМП.СписокВыбора[0].Значение;
		ЗаполнитьФормуПоУчетнойЗаписиМП();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
